# TU-Sofia - УПР 5: Разработка на програми с използване на функции.

**Здравейте**

В днешното упражнение ще разгледаме как се създават и използват функции.

## Кратко съдържание:

- **Подаване на параметри** 
- **Връщане на резултат**
- **Стойност по подразбиране**

---

# 1. Функции в Python

В програмирането функцията е самостоятелен блок код, който съдържа конкретна задача или група от взаимно свързани задачи. Ето някой вградени функции, предоставени от Python :

- id() - взема един аргумент и връща уникалния идентификатор на този обект;

```python
s = "foobar"
id(s)
#56313440
```
